[
  {
    "companyName": "Astrogem24",
    "designation": "Front-end Developer",
    "duration": "June 2022 - November 2022",
    "jobType": "Internship",
    "jobDescription": "Worked as a Front-end Developer at Astrogem24 where my key responsibility was to collaborating with a team of seven members across the globe & building a production ready e-commerce web application with MERN stack. I have also built reusable React components in the development & managed other team members tasks through GitHub and Google Meet.",
    "linkedInPageUrl": "https://www.linkedin.com/company/astrogem24/"
  },
  {
    "id": 2,
    "companyName": "SNL International",
    "designation": "React Developer",
    "duration": "December 2022 - June 2023",
    "jobType": "Contract",
    "jobDescription": "Worked as a React Developer at SNL International where my key responsibility was to building a web application for the company with an eye soothing user interface while caring about the demand of the client. I have also built reusable React components and tried to write well-documented codes.",
    "facebookPageUrl": "https://www.facebook.com/profile.php?id=100087734663658",
    "instagramPageUrl": "https://www.instagram.com/snl_bangladesh/?igshid=YmMyMTA2M2Y%3D",
    "websiteUrl": "http://snlbd.com"
  },
  {
    "id": 3,
    "companyName": "Pioneer Alpha",
    "designation": "Front-End Developer",
    "duration": "September 2023 - Present",
    "jobType": "Full-time",
    "jobDescription": "Working as a Front-End Developer at Pioneer Alpha where my responsibility is to collaborating with the front-end, back-end & the UI/UX team and developing state of the art web applications using Next.js, React.js, Tailwind CSS etc. This is a remote opportunity where I work am assigned tasks from the team lead through Asana and I also report the team lead through Asana once the assigned task is finished.",
    "facebookPageUrl": "https://www.facebook.com/pioneer.alpha.ltd",
    "linkedInPageUrl": "https://www.linkedin.com/company/pioneer-alpha",
    "websiteUrl": "https://pioneeralpha.com"
  }
]